# Используем официальный образ Go для сборки приложения
FROM golang:1.22-alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем все файлы проекта в рабочую директорию контейнера
COPY . .

# Собираем приложение
RUN go mod tidy && go build -o main .

# Используем более легкий образ для финального контейнера
FROM debian:bullseye-slim

# Устанавливаем рабочую директорию для выполнения приложения
WORKDIR /root/

# Копируем бинарник из предыдущего этапа
COPY --from=builder /app/main .

# Открываем порт 8000
EXPOSE 8000

# Запускаем приложение
CMD ["./main"]
